package aishev_JavaCore.lesson_1;

public class Hello {
    public static void main (String [] args ){
        System.out.println("Hello world!");
    }
}
// jdk отвечает за компеляцию, то есть преобразование кода с языка человека, на язык машины
//src - там будут классы
//класс - это способ логически отделять какую-то составную часть общего
//main  - стартовый метод
//все методы вызываются внутри (через) метода main
//метод = функция
//параметр метода - то, что после метода в круглых скобках
//в теле метода пишутся инструкции, которые будет метод выполнять
//ничего не может быть вне класса
//System.out.println(); - системный метод, который выводит на экран надпись (sout), параметр в двойных кавычках
//после компеляции (run) появилась папка out и в ней появился бинарный файл